STMicroelectronics/STM32CubeWBA/Projects/NUCLEO-WBA55CG/Applications/BLE/BLE_Power_Central/STM32_WPAN/App/gatt_client_app.c
      /* USER CODE END GATT_CLIENT_APP_Init_3 */
    }

    a_ClientContext[index].svcInfo[SVC_ID_GAP].uuid  = GAP_SERVICE_UUID;
    a_ClientContext[index].svcInfo[SVC_ID_GATT].uuid = GATT_SERVICE_UUID;
    /* USER CODE BEGIN GATT_CLIENT_APP_Init_4 */

    /* USER CODE END GATT_CLIENT_APP_Init_4 */
  }

  /* Register the event handler to the BLE controller */
  SVCCTL_RegisterCltHandler(Event_Handler);

  /* Register a task allowing to discover all services and characteristics and enable all notifications */
  UTIL_SEQ_RegTask(1U << CFG_TASK_DISCOVER_SERVICES_ID, UTIL_SEQ_RFU, client_discover_all);

  /* USER CODE BEGIN GATT_CLIENT_APP_Init_2 */

  PWR_CO_GPIO_Status = PWR_CO_GPIO_ON;

  for (i = 0 ; i < (USER_PAYLOAD_LENGTH) ; i++)
  {
    Notification_Data_Buffer[i] = i;
  }

  UTIL_SEQ_RegTask(1U << CFG_TASK_POCO_WRITE_CHAR_ID, UTIL_SEQ_RFU, SendDataWrite);
  a_ClientContext[0].MTUSizeValue = USER_PAYLOAD_LENGTH;

  /* USER CODE END GATT_CLIENT_APP_Init_2 */
  return;
}

void GATT_CLIENT_APP_Notification(GATT_CLIENT_APP_ConnHandle_Notif_evt_t *p_Notif)
{
  /* USER CODE BEGIN GATT_CLIENT_APP_Notification_1 */

  /* USER CODE END GATT_CLIENT_APP_Notification_1 */
  switch(p_Notif->ConnOpcode)
  {
    /* USER CODE BEGIN ConnOpcode */

    /* USER CODE END ConnOpcode */

    case PEER_CONN_HANDLE_EVT :
      /* USER CODE BEGIN PEER_CONN_HANDLE_EVT */

      /* USER CODE END PEER_CONN_HANDLE_EVT */
      break;

    case PEER_DISCON_HANDLE_EVT :
      /* USER CODE BEGIN PEER_DISCON_HANDLE_EVT */
    {
      uint8_t index = 0;
      for(index = 0 ; index < BLE_CFG_CLT_MAX_NBR_CB ; index++)
      {
        if (a_ClientContext[index].connHdl == p_Notif->ConnHdl)
        {
          a_ClientContext[index].state = GATT_CLIENT_APP_IDLE;
        }
      }
    }

      /* USER CODE END PEER_DISCON_HANDLE_EVT */
      break;

    default:
      /* USER CODE BEGIN ConnOpcode_Default */

      /* USER CODE END ConnOpcode_Default */
      break;
  }
  /* USER CODE BEGIN GATT_CLIENT_APP_Notification_2 */

  /* USER CODE END GATT_CLIENT_APP_Notification_2 */
  return;
}

uint8_t GATT_CLIENT_APP_Set_Conn_Handle(uint8_t index, uint16_t connHdl)
{
  uint8_t ret;

  if (index < BLE_CFG_CLT_MAX_NBR_CB)
  {
    a_ClientContext[index].connHdl = connHdl;
    ret = 0;
  }
  else
  {
    ret = 1;
  }

  return ret;
}

uint8_t GATT_CLIENT_APP_Get_State(uint8_t index)
{
  return a_ClientContext[index].state;
}

void GATT_CLIENT_APP_Discover_services(uint8_t index)
{
  GATT_CLIENT_APP_Procedure_Gatt(index, PROC_GATT_DISC_ALL_PRIMARY_SERVICES);
  GATT_CLIENT_APP_Procedure_Gatt(index, PROC_GATT_DISC_ALL_CHARS);
  GATT_CLIENT_APP_Procedure_Gatt(index, PROC_GATT_DISC_ALL_DESCS);
  GATT_CLIENT_APP_Procedure_Gatt(index, PROC_GATT_PROPERTIES_ENABLE_ALL);

  return;
}

uint8_t GATT_CLIENT_APP_Procedure_Gatt(uint8_t index, ProcGattId_t GattProcId)
{
  uint16_t svcIdx;
  tBleStatus bleStatus = BLE_STATUS_SUCCESS;
  uint8_t status;

  if (index >= BLE_CFG_CLT_MAX_NBR_CB)
  {
    status = 1;
  }
  else
  {
    status = 0;
    switch (GattProcId)
    {
      case PROC_GATT_DISC_ALL_PRIMARY_SERVICES:
      {
        a_ClientContext[index].state = GATT_CLIENT_APP_DISCOVER_SERVICES;

        LOG_INFO_APP("GATT services discovery\n");
        bleStatus = aci_gatt_disc_all_primary_services(a_ClientContext[index].connHdl);

        if (bleStatus == BLE_STATUS_SUCCESS)
        {
          gatt_cmd_resp_wait();
          LOG_INFO_APP("PROC_GATT_DISC_ALL_PRIMARY_SERVICES services discovered Successfully\n\n");
        }
        else
        {
          LOG_ERROR_APP("PROC_GATT_DISC_ALL_PRIMARY_SERVICES aci_gatt_disc_all_primary_services cmd Failed, status =0x%02X\n\n", bleStatus);
          status++;
        }
      }
      break; /* PROC_GATT_DISC_ALL_PRIMARY_SERVICES */

      case PROC_GATT_DISC_ALL_CHARS:
      {
        a_ClientContext[index].state = GATT_CLIENT_APP_DISCOVER_CHARACS;

        LOG_INFO_APP("DISCOVER_ALL_CHARS on ConnHdl=0x%04X\n",a_ClientContext[index].connHdl);
        for (svcIdx = 0; svcIdx < SVC_ID_MAX; svcIdx++)
        {
          if(a_ClientContext[index].svcInfo[svcIdx].uuid != 0)
          {
            LOG_INFO_APP("  Service UUID 0x%04X, svcHdl[0x%04X - 0x%04X]\n",
                              a_ClientContext[index].svcInfo[svcIdx].uuid,
                              a_ClientContext[index].svcInfo[svcIdx].charStartHdl,
                              a_ClientContext[index].svcInfo[svcIdx].charEndHdl);
            bleStatus = aci_gatt_disc_all_char_of_service(
                              a_ClientContext[index].connHdl,
                              a_ClientContext[index].svcInfo[svcIdx].charStartHdl,
                              a_ClientContext[index].svcInfo[svcIdx].charEndHdl);

            if (bleStatus == BLE_STATUS_SUCCESS)
            {
              gatt_cmd_resp_wait();
              LOG_INFO_APP("  Service UUID 0x%04X characteristics discovered Successfully\n\n",
                            a_ClientContext[index].svcInfo[svcIdx].uuid);
              a_ClientContext[index].svcInfo[svcIdx].status = SVC_INFO_STATUS_DISCOVERED;
            }
            else
            {
              LOG_ERROR_APP("  Service UUID 0x%04X characteristics discovery Failed, status =0x%02X\n\n",
                            a_ClientContext[index].svcInfo[svcIdx].uuid, bleStatus);
              status++;
            }
            /* USER CODE BEGIN PROC_GATT_DISC_ALL_CHARS_0 */

            /* USER CODE END PROC_GATT_DISC_ALL_CHARS_0 */
          }
        }
        /* USER CODE BEGIN PROC_GATT_DISC_ALL_CHARS */

        /* USER CODE END PROC_GATT_DISC_ALL_CHARS */
        if (status == 0)
        {
          LOG_INFO_APP("All characteristics discovered Successfully\n\n");
        }
        else
        {
          LOG_ERROR_APP("All characteristics discovery Failed\n\n");
        }
      }
      break; /* PROC_GATT_DISC_ALL_CHARS */

      case PROC_GATT_DISC_ALL_DESCS:
      {
        a_ClientContext[index].state = GATT_CLIENT_APP_DISCOVER_WRITE_DESC;

        LOG_INFO_APP("DISCOVER_ALL_CHAR_DESCS on ConnHdl=0x%04X\n",
                              a_ClientContext[index].connHdl);
        for (svcIdx = 0; svcIdx < SVC_ID_MAX; svcIdx++)
        {
          if(a_ClientContext[index].svcInfo[svcIdx].uuid != 0)
          {
            LOG_INFO_APP("  Service UUID 0x%04X, svcHdl[0x%04X - 0x%04X]\n",
                              a_ClientContext[index].svcInfo[svcIdx].uuid,
                              a_ClientContext[index].svcInfo[svcIdx].charStartHdl,
                              a_ClientContext[index].svcInfo[svcIdx].charEndHdl);
            bleStatus = aci_gatt_disc_all_char_desc(
                              a_ClientContext[index].connHdl,
                              a_ClientContext[index].svcInfo[svcIdx].charStartHdl,
                              a_ClientContext[index].svcInfo[svcIdx].charEndHdl);

